package com.example.springbootfileupload.util;

import java.util.Arrays;
import java.util.List;
import java.util.Set;
import java.util.stream.Collectors;

public class ExcludedWordUtil {
    private static final String[] russianUnions = {
        "а", "вдобавок", "именно", "также", "то", "благодаря", "благо", "буде", "будто", "вдобавок", "дабы", "даже", "же",
        "едва", "ежели", "если", "затем", "зато", "зачем", "и", "ибо", "из-за", "или", "кабы", "как", "когда", "коли",
        "либо", "лишь", "нибудь", "нежели", "но", "однако", "особенно", "оттого", "отчего", "пока", "покамест", "покуда", "поскольку",
        "потому", "почему", "прежде", "притом", "причем", "пускай", "пусть", "раз", "словно", "также", "то", "тоже",
        "только", "точно", "хотя", "чем", "что", "чтоб", "чтобы"
    };

    private static final String[] russianPrepositions = {
        "в", "до", "для", "за", "из", "к", "на", "над", "о", "об", "от", "по", "под", "перед", "при", "про", "с", "у",
        "через" , "бы" , "не"
    };

    private static final String[] russianPronouns = {
        "я", "ты", "мы", "вы", "он", "она", "оно", "они", "себя", "себе", "тебя", "тебе", "мой", "моя", "мое", "мои",
        "твой", "твоя", "твое", "твои", "наш", "наша", "наше", "наши", "ваш", "ваша", "ваше", "ваши", "свой", "своя",
        "свое", "свои", "кто", "что", "какой", "какая", "какое", "какие", "каков", "какова", "каково", "каковы",
        "который", "которая", "которые", "которое", "чей", "чья", "чье", "чьи", "сколько", "никто", "ничто", "некого",
        "нечего", "никакой", "никакая", "никакое", "никакие", "ничей", "ничья", "ничье", "ничьи", "нисколько", "некто",
        "нечто", "некоторый", "некоторая", "некоторое", "некоторые", "кто-то", "что-то", "сколько-то", "что-либо",
        "кое", "сам", "сама", "само", "сами", "самый", "самая", "самое", "самые", "каждый", "каждая", "каждое", "каждые",
        "любой", "любая", "любые", "любое", "всякий", "всякая", "всякое", "всякие", "иной", "иная", "иное", "иные",
        "весь", "все", "вся", "все", "этот", "эта", "это", "эти", "тот", "та", "те", "то", "такой", "такая", "такое",
        "такие", "таков", "такова", "таково", "таковы", "столько", "его", "ее", "ему", "ей", "им", "их", "того" , "той",
        "теми", "ими"
    };

    private static final String[][] allWords = {russianUnions, russianPrepositions, russianPronouns};

    public static Set<String> exludedRussianWords(){
        return Arrays.stream(allWords).flatMap(Arrays::stream).collect(Collectors.toSet());
    }


}
